# **Aggregation and Grouping**  
***
Grouping and aggregating helps you summarize your data — like answering:
- “What’s the average salary per department?”
- “How many users joined the Gym per month?”
***
.groupby() function- df.groupby() is used to group rows of a DataFrame based on the values in one or
more columns, which allows you to then perform aggregate functions (like sum(),
mean(), count(), etc.) on each group. Consider this DataFrame:

In [3]:
import pandas as pd

In [5]:
df = pd.DataFrame({
"Department": ["HR", "HR", "IT", "IT", "Marketing", "Marketing", "Sales", "Sales"],
"Team": ["A", "A", "B", "B", "C", "C", "D", "D"],
"Gender": ["M", "F", "M", "F", "M", "F", "M", "F"],
"Salary": [85, 90, 78, 85, 92, 88, 75, 80],
"Age": [23, 25, 30, 22, 28, 26, 21, 27],
"JoinDate": pd.to_datetime([
"2020-01-10", "2020-02-15", "2021-03-20", "2021-04-10",
"2020-05-30", "2020-06-25", "2021-07-15", "2021-08-01"
])
})
df

  Department Team Gender  Salary  Age   JoinDate
0         HR    A      M      85   23 2020-01-10
1         HR    A      F      90   25 2020-02-15
2         IT    B      M      78   30 2021-03-20
3         IT    B      F      85   22 2021-04-10
4  Marketing    C      M      92   28 2020-05-30
5  Marketing    C      F      88   26 2020-06-25
6      Sales    D      M      75   21 2021-07-15
7      Sales    D      F      80   27 2021-08-01

In [7]:
df.groupby("Department")['Salary'].mean()
#This says: “Group by Department, then calculate average Salary for each group.”

Department
HR           87.5
IT           81.5
Marketing    90.0
Sales        77.5
Name: Salary, dtype: float64

**Common Aggregate Functions**

In [9]:
df.groupby("Department")['Salary'].sum()

Department
HR           175
IT           163
Marketing    180
Sales        155
Name: Salary, dtype: int64

In [11]:
df.groupby("Department")['Salary'].count()

Department
HR           2
IT           2
Marketing    2
Sales        2
Name: Salary, dtype: int64

In [13]:
df.groupby("Department")['Salary'].max()

Department
HR           90
IT           85
Marketing    92
Sales        80
Name: Salary, dtype: int64

In [15]:
df.groupby("Department")['Salary'].min()

Department
HR           85
IT           78
Marketing    88
Sales        75
Name: Salary, dtype: int64

To group multiple columns

In [19]:
df.groupby(['Department', 'Team', 'Gender'])['Salary'].mean()

Department  Team  Gender
HR          A     F         90.0
                  M         85.0
IT          B     F         85.0
                  M         78.0
Marketing   C     F         88.0
                  M         92.0
Sales       D     F         80.0
                  M         75.0
Name: Salary, dtype: float64

# **Custom Aggregations with .agg()**
***
Apply Multiple Functions at once
- Note - In pandas, .agg and .aggregate are exactly the same — they’re aliases for the same method

In [26]:
df.groupby('Department')['Salary'].agg(["mean", "max", "min", "sum", "count"])

            mean  max  min  sum  count
Department
HR          87.5   90   85  175      2
IT          81.5   85   78  163      2
Marketing   90.0   92   88  180      2
Sales       77.5   80   75  155      2

Apply different functions to different columns:

In [28]:
df.groupby('Team').aggregate({"Salary":"mean", "Age" : "max"})

      Salary  Age
Team
A       87.5   25
B       81.5   30
C       90.0   28
D       77.5   27

.transform()- Return Same Shape as Original
- Add new column based on the group

In [31]:
df['Team Avg'] = df.groupby('Team')['Salary'].transform("mean")
df

  Department Team Gender  Salary  Age   JoinDate  Team Avg
0         HR    A      M      85   23 2020-01-10      87.5
1         HR    A      F      90   25 2020-02-15      87.5
2         IT    B      M      78   30 2021-03-20      81.5
3         IT    B      F      85   22 2021-04-10      81.5
4  Marketing    C      M      92   28 2020-05-30      90.0
5  Marketing    C      F      88   26 2020-06-25      90.0
6      Sales    D      M      75   21 2021-07-15      77.5
7      Sales    D      F      80   27 2021-08-01      77.5

.filter() - Returns subset of rows. Keep/Discard whole groups

In [32]:
df.groupby('Team').filter(lambda x : x['Salary'].mean()> 85)

  Department Team Gender  Salary  Age   JoinDate  Team Avg
0         HR    A      M      85   23 2020-01-10      87.5
1         HR    A      F      90   25 2020-02-15      87.5
4  Marketing    C      M      92   28 2020-05-30      90.0
5  Marketing    C      F      88   26 2020-06-25      90.0